{
  "education": [
    {
      "school": "Noida Institute of Engineering & Technology, Gr. Noida",
      "degree": "B.Tech. in Information Technology",
      "graduated": "2014",
      "description": "Studied Computer Science and Mathematics."
    }
  ],
  "experience": [
    {
      "company": "Adidas",
      "url": "https://adidas.com",
      "heading": "Since 2022",
      "type": "Full Time",
      "positions": [
        {
          "title": "Software Engineer L2",
          "duration": "Oct 2024 - Present",
          "description": [
            "Developed a software suite comprising multiple micro-frontend applications, using React, Typescript, SCSS, and AgGrid.",
            "Set up foundational boilerplate code for micro-frontends, ensuring code quality and performance.",
            "Presented a talk 'The Dark Knight Rises... In CSS' at Adidas Frontend community."
          ],
          "location": "Gurugram, Haryana"
        },
        {
          "title": "Software Engineer L1",
          "duration": "Jun 2022 - Sep 2024 | 2 yrs 4 mos",
          "description": [
            "Developed a PowerPoint like presentation tool for Adidas internal use, using React, Typescript, Redux, SCSS, and Node.js.",
            "Ensured excellent code quality resulting in a highly performant tool that significantly aids the product team in planning the product market journey.",
            "Daily tasks include reviewing pull requests, mentoring junior developers, and working on coding assignments.",
            "Actively engaged in community-building initiatives to foster collaboration and knowledge sharing within the team.",
            "Presented a talk on 'Typescript Tips & Tricks' to whole Frontend community at Adidas."
          ],
          "location": "Gurugram, Haryana"
        }
      ],
      "description": "Adidas AG is a multinational corporation, founded and headquartered in Herzogenaurach, Germany, that designs and manufactures shoes, clothing, and accessories. It is the largest sportswear manufacturer in Europe, and the second largest in the world, after Nike.",
      "img": "adidas_miqnav",
      "imgDark": "adidas-white_agh379"
    },
    {
      "company": "Publicis Sapient",
      "url": "https://www.publicissapient.com/",
      "heading": "2018 - 2022",
      "type": "Full Time",
      "positions": [
        {
          "title": "Senior Associate Experience Technology L2",
          "duration": "Feb 2022 - Jun 2022 | 5 mos",
          "description": [
            "Set up foundational code structure enforcing industry best practices and project-specific guidelines using HTML, SCSS, jQuery, and Bootstrap.",
            "Enhanced application performance by 40% by segregating essential scripts via webpack",
            "Enhanced ESLint, Prettier, and Project coding guidelines to ensure apex code quality.",
            "Offered tech guidance and code reviewing within the team and helped on-boarding new team members."
          ],
          "location": "Gurugram, Haryana"
        },
        {
          "title": "Senior Associate Experience Technology L1",
          "duration": "Feb 2019 - Jan 2022 | 3 yrs",
          "description": [
            "Implemented a scalable architecture accomodating multiple locales and introduced a shared code repository using Git Dub-modules.",
            "Established coding guidelines and repository ethics, enforcing commit/push rules using Husky. Also integrated essential tools like ESLint, Prettier, and Stylelint.",
            "Designed a versatile Next.js page generator for diverse page templates and added custom theming methodology using CSS Modules and SCSS.",
            "Daily tasks included code reviews, writing unit test cases, rregular sprint tasks, bug fixes and helping team members with their tasks."
          ],
          "location": "Gurugram, Haryana"
        },
        {
          "title": "Associate Experience Technology L2",
          "duration": "Mar 2018 - Feb 2019 | 1 yr",
          "description": [
            "Maintained, added new features, and improved the legacy code of the platform of 58 AEM (Adobe Experience Manager) websites.",
            "Enhanced frontend architecture, reduced code redundancy, and optimized performance.",
            "Developed a custom Javascript framework for improved page performance. Google light house score increased from ~30 to ~80."
          ],
          "location": "Gurugram, Haryana"
        }
      ],
      "description": "Publicis Sapient is a digital business transformation company. It provides business consulting, technology, and customer experience services. The company is organized as a matrix, combining vertical expertise with a focus on technology and platforms.",
      "img": "ps_a0o56a",
      "imgDark": "ps-white_k7xgqb"
    },
    {
      "company": "Wazo Studio",
      "url": "https://www.facebook.com/wazostudio/",
      "heading": "2016 - 2018",
      "type": "Full Time",
      "positions": [
        {
          "title": "Frontend Developer",
          "duration": "Nov 2016 - Feb 2018 | 1 yr 4 mos",
          "description": [
            "Developed a Real Estate software suite, catering to RERA requirements, utilizing Angular JS (v1), Typescript, and Node.js.",
            "Implemented responsive designs and developed a comprehensive system, encompassing color schemes, spacings, typography, and SCSS.",
            "Enabled 'offline usage' using Google Lovefield and the browser's local database."
          ],
          "location": "New Delhi, India"
        }
      ],
      "description": "Wazo Studio is a software development company that specializes in creating software for Real Estate Developers.",
      "img": "wazo_jyw17l"
    },
    {
      "company": "SaaS Labs, Inc",
      "location": "Noida, India",
      "url": "https://www.saaslabs.co/",
      "heading": "2016",
      "type": "Full Time",
      "positions": [
        {
          "title": "Frontend Developer aka Code Junkie",
          "duration": "Mar 2016 - Oct 2016 | 8 mos",
          "description": [
            "Contributed to a marketing automation and social media growth project on Pinterest and Instagram, utilizing PHP, jQuery, Bootstrap, HTML, and CSS.",
            "Succesfully managed promotions and marketing for Viralwoot, Pricewoot, Piktoria, Storewoot and My Social Pig on Pinterest, Etsy , and Instagram.",
            "Developed Google Chrome Extensions for Viralwoot, Piktoria and a GIF maker.",
            "Implemented a real-time analytics application akin to a CCTV camera for websites, providing valuable insights into user activity."
          ],
          "location": "Noida, India"
        }
      ],
      "description": "SaaS Labs is a software development company that specializes in creating software for Social Media Marketing.",
      "img": "saaslabs_buylgj"
    },
    {
      "company": "Hestabit Technologies Pvt. Ltd.",
      "url": "https://www.hestabit.com/",
      "heading": "2014 - 2016",
      "type": "Full Time",
      "positions": [
        {
          "title": "Frontend Developer",
          "duration": "Sep 2014 - Feb 2016 | 1 yr 6 mos",
          "description": [
            "Developed an Educational Institution's CMS using JavaScript, jQuery, HTML, CSS, and PHP.",
            "Created an internal tool with plugins and ready-to-use codes for streamlining the development process.",
            "Executed multiple Wordpress projects."
          ],
          "location": "Noida, India"
        }
      ],
      "description": "Hestabit Technologies is a software development company that specializes in creating software for Educational Institutes and Organizations.",
      "img": "hestabit_ekyn8k"
    },
    {
      "company": "Genpact Headstrong Capital Markets",
      "url": "https://www.genpact.com/",
      "heading": "2013",
      "type": "Internship",
      "positions": [
        {
          "title": "Trainee",
          "duration": "May 2013 - Jun 2013 | 2 mos",
          "description": [
            "Acquired skills in creating Hybrid Mobile Applications with Apache Cordova, jQuery Mobile, Parse.com and HTML.",
            "Conducted mobile app prototypingusing Fluid UI",
            "Developed a thrilling Quiz game for Android and iOS using hybrid mobile app technology.",
            "Designed an employee task management app for transport booking, food ordering via cafeteria and meeting room booking."
          ],
          "location": "Noida, India"
        }
      ],
      "description": "Genpact Headstrong Capital Markets (now Genpact) was a software development company",
      "img": "headstrong_n8tg21"
    }
  ]
}
